//Путь к вашему классу - структура пакетов до вашего класса
package com.TelRun.base.lesson2;

//Сигнатура класса (public -модификация доступа, class - тип, Example)

public class Example {
    //тело класса - это то, что находится между {}
    //переменные и методв
    //переменные нужны, чтобы хранить какие-то данные (свойства объекта)
    //методы нужны, чтобы хранить там написанный код (мы пишем код, который показывает, что умеет наш класс)
    //метод - кроме кода тоже содержит переменные, которые нужны для работы кода внутри метода

    //Класс это шаблон, который описывает какими свойствами и методами (поведением) может обладать объект, который мы создадим на основании этого класса.
}
