package com.TelRun.base.lesson5;

/**
 * if - если условие истина, то нужно что-то сделать
 * if - else - если условие истина, то нужно что-то сделать, иначе, если условие ложь, то нужно сделать что-то другое
 * if - else - if - если условие истина, то нужно что-то сделать, иначе,
 * если условие ложь, то нужно сделать что-то другое, а этим другим будет еще одно условие.
 * nested if - внутри одного условия находится другое условие
 * instruction return - внутри условия можно использовать оператор возврата, чтобы прервать выполнения кода условия
 */
public class Theory {
}
